const user = [

]

const seekers = [

]


const companies = [

]

const openings = [

]

const categoryPosition =
    [
        ['軟體開發', "後端工程"],
        ['軟體開發', "前端工程"],
        ['軟體開發', "全端工程"],
        ['軟體開發', "測試工程"],
        ['軟體開發', "遊戲開發"],
        ['軟體開發', "行動裝置開發"],
        ['軟體開發', "DevOp]s / SRE"],
        ['軟硬體系統整合', "韌體 / 電子電路"],
        ['軟硬體系統整合', "硬體工程"],
        ['軟硬體系統整合', "半導體"],
        ['軟硬體系統整合', "光電工程"],
        ['資料工程', "資料工程 / 機器學習"],
        ['系統與基礎架構', 'MIS / 網路管理'],
        ['系統與基礎架構', '通訊電信'],
        ['行銷 / 企劃 / 內容', '行銷企劃 / 社群經營'],
        ['行銷 / 企劃 / 內容', '編輯 / 內容經營'],
        ['行銷 / 企劃 / 內容', '廣告創意 / 企劃'],
        ['行銷 / 企劃 / 內容', '攝影 / 影音製作'],
        ['行銷 / 企劃 / 內容', 'Growth Hacker'],
        ['行銷 / 企劃 / 內容', '媒體公關 / 宣傳採買'],
        ['營運', '人資'],
        ['營運', '財務 / 會計'],
        ['營運', '行政'],
        ['營運', '營運'],
        ['營運', '客戶服務'],
        ['營運', '法務'],
        ['市場開發', '商業開發'],
        ['市場開發', '通路開發'],
        ['市場開發', '實體經營'],
        ['市場開發', '市場分析'],
        ['市場開發', '銷售業務'],
        ['產品 / 設計', '專案 / 產品管理'],
        ['產品 / 設計', 'UIUX / 視覺設計'],
        ['產品 / 設計', '3D / 動畫設計'],
        ['其他', '教育 / 教學'],
        ['其他', '研究人員'],
        ['其他', '其他'],
    ]

const location = [
    ["台北市"],
    ["新北市"],
    ["桃園市"],
    ["新竹市"],
    ["新竹縣"],
    ["台中市"],
    ["彰化縣"],
    ["嘉義市"],
    ["台南市"],
    ["高雄市"],
    ["花蓮縣"],
    ["海外"],
]

const tags = [
    ['Python'],
    ['JavaScript'],
    ['React'],
    ['C++'],
    ['Ruby'],
    ['Golang'],
    ['HYML/CSS'],
    ['Linux'],
    ['AWS'],
    ['Docker'],
    ['SQL'],
    ['NoSQL'],
    ['Redis'],
]

module.exports = {
    user,
    seekers,
    companies,
    openings,
    categoryPosition,
    location,
    tags
}